src/test/resources/apiXml/GMMP/GetVisitJobs.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:env="env" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <soap:Header>
        <wsse:Security xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" env:mustUnderstand="1">
<!--            <wsu:Timestamp wsu:Id="Timestamp-4247B214FE160E293B15360920634652">-->
<!--                <wsu:Created>2021-02-11T15:31:15.398</wsu:Created>-->
<!--                <wsu:Expires>2021-02-11T15:36:15.398</wsu:Expires>-->
<!--            </wsu:Timestamp>-->
            <wsse:UsernameToken>
                <wsse:Username>mpgm-ws-connect_a18</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">aicKWUVxsGR#B{24j*DavbMLyJ*4Y4KkREiBzi9c</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </soap:Header>
    <soap:Body>
        <getVisitJobs xmlns="http://www.cliffordthames.com/ebusiness/menus/">
            <visitJobsRequest>
                <dealerDetails countryCode="US" languageCode="EN" manufacturer="GM" vehicleFileID="0"/>
            </visitJobsRequest>
        </getVisitJobs>
    </soap:Body>
</soap:Envelope>